JBHarvey/design-iii/src/stm32/dev/src/main.c
			PID_POSITION1.mySetpoint = xMove;
			PID_POSITION3.mySetpoint = xMove;
			PID_POSITION2.mySetpoint = yMove;
			PID_POSITION4.mySetpoint = yMove;

			numberOfPositionEdges1 = 0;
			numberOfPositionEdges2 = 0;
			numberOfPositionEdges3 = 0;
			numberOfPositionEdges4 = 0;

			PID_POSITION1.ITerm = 0;
			PID_SPEED1.ITerm = 0;
			PID_POSITION2.ITerm = 0;
			PID_SPEED2.ITerm = 0;
			PID_POSITION3.ITerm = 0;
			PID_SPEED3.ITerm = 0;
			PID_POSITION4.ITerm = 0;
			PID_SPEED4.ITerm = 0;

			PID_POSITION1.lastInput = 0;
			PID_SPEED1.lastInput = 0;
			PID_POSITION2.lastInput = 0;
			PID_SPEED2.lastInput = 0;
			PID_POSITION3.lastInput = 0;
			PID_SPEED3.lastInput = 0;
			PID_POSITION4.lastInput = 0;
			PID_SPEED4.lastInput = 0;

			incWheel1Canal1EncoderCounter = 0;
			incWheel1Canal2EncoderCounter = 0;
			decWheel1Canal1EncoderCounter = 0;
			decWheel1Canal2EncoderCounter = 0;

			incWheel2Canal1EncoderCounter = 0;
			incWheel2Canal2EncoderCounter = 0;
			decWheel2Canal1EncoderCounter = 0;
			decWheel2Canal2EncoderCounter = 0;

			incWheel3Canal1EncoderCounter = 0;
			incWheel3Canal2EncoderCounter = 0;
			decWheel3Canal1EncoderCounter = 0;
			decWheel3Canal2EncoderCounter = 0;

			incWheel4Canal1EncoderCounter = 0;
			incWheel4Canal2EncoderCounter = 0;
			decWheel4Canal1EncoderCounter = 0;
			decWheel4Canal2EncoderCounter = 0;

			setState(&mainState, MAIN_PID);
		}
		break;
	case COMMAND_PENCIL_UP:
		moveUpPrehensor();
		break;

	case COMMAND_PENCIL_DOWN:
		moveDownPrehensor();
		break;
	case COMMAND_DECODE_MANCHESTER:
		setState(&mainState, MAIN_MANCH);
		break;
	case COMMAND_STOP_DECODE_MANCHESTER:
		setState(&mainState, MAIN_IDLE);
		break;
	}
}
